OpenNuvoton/NUC970_U-Boot_v2016.11/include/nuc970_keypad.h


#ifndef _NUC970KPI_H_
#define _NUC970KPI_H_

// Press key value
#define KEY_P_ROW0_COL0 1
#define KEY_P_ROW0_COL1 2
#define KEY_P_ROW0_COL2 3
#define KEY_P_ROW0_COL3 4
#define KEY_P_ROW0_COL4 5
#define KEY_P_ROW0_COL5 6
#define KEY_P_ROW0_COL6 7
#define KEY_P_ROW0_COL7 8
#define KEY_P_ROW1_COL0 9
#define KEY_P_ROW1_COL1 10
#define KEY_P_ROW1_COL2 11
#define KEY_P_ROW1_COL3 12
#define KEY_P_ROW1_COL4 13
#define KEY_P_ROW1_COL5 14
#define KEY_P_ROW1_COL6 15
#define KEY_P_ROW1_COL7 16
#define KEY_P_ROW2_COL0 17
#define KEY_P_ROW2_COL1 18
#define KEY_P_ROW2_COL2 19
#define KEY_P_ROW2_COL3 20
#define KEY_P_ROW2_COL4 21
#define KEY_P_ROW2_COL5 22
#define KEY_P_ROW2_COL6 23
#define KEY_P_ROW2_COL7 24
#define KEY_P_ROW3_COL0 25
#define KEY_P_ROW3_COL1 26
#define KEY_P_ROW3_COL2 27
#define KEY_P_ROW3_COL3 28
#define KEY_P_ROW3_COL4 29
#define KEY_P_ROW3_COL5 30
#define KEY_P_ROW3_COL6 31
#define KEY_P_ROW3_COL7 32

// Release key value
#define KEY_R_ROW0_COL0 33
#define KEY_R_ROW0_COL1 34
#define KEY_R_ROW0_COL2 35
#define KEY_R_ROW0_COL3 36
#define KEY_R_ROW0_COL4 37
#define KEY_R_ROW0_COL5 38
#define KEY_R_ROW0_COL6 39
#define KEY_R_ROW0_COL7 40
#define KEY_R_ROW1_COL0 41
#define KEY_R_ROW1_COL1 42
#define KEY_R_ROW1_COL2 43
#define KEY_R_ROW1_COL3 44
#define KEY_R_ROW1_COL4 45
#define KEY_R_ROW1_COL5 46
#define KEY_R_ROW1_COL6 47
#define KEY_R_ROW1_COL7 48
#define KEY_R_ROW2_COL0 49
#define KEY_R_ROW2_COL1 50
#define KEY_R_ROW2_COL2 51
#define KEY_R_ROW2_COL3 52
#define KEY_R_ROW2_COL4 53
#define KEY_R_ROW2_COL5 54
#define KEY_R_ROW2_COL6 55
#define KEY_R_ROW2_COL7 56
#define KEY_R_ROW3_COL0 57
#define KEY_R_ROW3_COL1 58
#define KEY_R_ROW3_COL2 59
#define KEY_R_ROW3_COL3 60
#define KEY_R_ROW3_COL4 61
#define KEY_R_ROW3_COL5 62
#define KEY_R_ROW3_COL6 63
#define KEY_R_ROW3_COL7 64

unsigned int nuc970_KPI_Read(void);
void nuc970_KPI_close(void);



#endif



